app/controllers/expences_controller.rb

SELECT * FROM `users` WHERE (`users`.`username` = 'sde') LIMIT 1
---
  def index
    logger.debug "[info]ExpencesController.index called"
    @user = User.find_by_username(params[:username])

SELECT * FROM `users` WHERE (`users`.`username` = 'sde') LIMIT 1
---
  def show
    logger.debug "[info]ExpencesController.show called"
    @user = User.find_by_username(params[:username])

SELECT * FROM `users` WHERE (`users`.`username` = 'sde') LIMIT 1
---
  def new
    logger.debug "[info]ExpencesController.new called"
    @user = User.find_by_username(params[:username])

SELECT * FROM `users` WHERE (`users`.`username` = 'fred') LIMIT 1
INSERT INTO `expences` (`category`, `latitude`, `created_at`, `body`, `updated_at`, `amount`, `tag`, `longditude`, `user_id`, `currency`) VALUES('dfgfde', 1, '2010-08-15 20:43:55', 'sdfds', '2010-08-15 20:43:55', 1, '1', 1, NULL, 'USD')
---
  def create
    logger.debug "[info]create called"
    @user = User.find_by_username(params[:username])
    @expence = @user.expences.build(params[:expence])
    #@expence = Expence.new(params[:expence])
    if @expence.save

DELETE FROM `expences` WHERE `id` = 1
---
  def destroy
    @expence.destroy

UPDATE `expences` SET `updated_at` = '2010-07-30 23:47:50', `currency` = 'USD' WHERE `id` = 2
---
def update

  if @expence.update_attributes(params[:expence])

SELECT * FROM `expences` WHERE (`expences`.user_id = 9)
---
    def find_expence
      @user = User.find_by_username(params[:username])
      @expence = Expence.find(params[:id])