app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `password_hash`, `email`) VALUES('2010-08-02 15:06:21', '2010-08-02 15:06:21', '7e240de74fb1ed08fa08d38063f6a6a91462a815', 'simon@simondelliott.com')

  def destroy
    @user.destroy
---
DELETE FROM `users` WHERE `id` = 2

def update

  if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-08-02 15:09:42', `password_hash` = '64875fcccaac069fcb3e0e201e7d5b9166641608' WHERE `id` = 1

    def find_user
      # rails will always use id as the default for the first param passed
      # in on the query string
      @user = User.find_by_username(params[:username])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'simon@simondelliott') LIMIT 1